	PROGRAM-ID.A.DATA DIVISION.LOCAL-STORAGE SECTION. 1 L PIC X(51).
	1 T PIC X(51). 1 I PIC 99. 1 K PIC 9. PROCEDURE DIVISION.
	A.
	ACCEPT L
	PERFORM VARYING I FROM 1 BY 1 UNTIL I > 50
	IF L(I:1)="T" MOVE L TO T END-IF
	IF L(I:1)="K" MOVE 1 TO K END-IF
	IF K=1 IF T(I:1)="T" DISPLAY T STOP RUN
	ELSE MOVE "K" TO T(I:1) END-IF END-IF
	END-PERFORM.
	DISPLAY T
	GO TO A.
	STOP RUN.